import { Topic } from "./types";

export const topicList: Topic[] = [
  {
    id: 0,
    imagePath: "/recommendation_news_small_image.png",
    largeImagePath: "/recommendation_news_image.png",
    title: "【 動物園はあるべきか、それとも廃止するべきか 】",
    text: "日本は動物園大国ですが、その存在については賛否が分かれています。一部では、檻に閉じ込められた動物たちが可哀想だと感じ、檻に閉じ込められた動物たちが一生を送る辛さを問いかける意見があります。\n\nしかし、子ども時代に動物園で生き物を直接見た感動や、希少動物の保存に貢献するなどの役割を評価する声も多くあります。動物の福祉や市民ニーズとの調和を図りつつ、動物園の新たな形を模索する時代が到来しています。",
    textShort:
      "動物園の存在に対して賛否が分かれている。動物園はあるべきか、それとも廃止するべきか？",
    contents: [
      {
        id: 0,
        text: "子どもたちが直接動物を見ることで、動物園は自然への敬意や生物の大切さを学べる貴重な場所です。",
        label: 0,
      },
      {
        id: 1,
        text: "動物園では希少動物の保存活動が行われているんだ。絶滅の危機がある動物たちを救うために絶対に必要なんだよな。",
        label: 0,
      },
      {
        id: 2,
        text: "動物園は、動物と人間のつながりをダイレクトに深め、互いの理解を促進する本当に大切な場所ですよ。",
        label: 0,
      },
      {
        id: 3,
        text: "世界中で行われてる動物の保護活動をサポートするための場として、動物園の存在は不可欠だ。",
        label: 0,
      },
      {
        id: 4,
        text: "動物園は地域の観光資源として、経済的な恩恵をもたらしています。その存在は地域経済にとって必要不可欠。",
        label: 0,
      },
      {
        id: 5,
        text: "生物学や動物行動学の研究には、動物園での観察が欠かせないと考えてるんすよね。",
        label: 0,
      },
      {
        id: 6,
        text: "動物園は昔からの家族のレジャースポットで、その文化を継続する価値があると思う。",
        label: 0,
      },
      {
        id: 7,
        text: "動物園にある繁殖プログラムは、絶滅危機にある動物の生存に貢献しているのでは。",
        label: 0,
      },
      {
        id: 8,
        text: "私が考える限り、実際の動物を目の前で見ることは、子どもたちの学びや興味を引き出す最良の方法です。",
        label: 0,
      },
      {
        id: 9,
        text: "動物園は家族のお出かけスポットとして、みなの憩いの場としての役割を果たしている。",
        label: 0,
      },
      {
        id: 10,
        text: "動物園は教育の一環としての役割がある。ただ、動物の福祉もその上で考慮しなきゃね。",
        label: 0,
      },
      {
        id: 11,
        text: "絶滅危惧種の保護はとても重要です。でも、今の動物園の形式とは別にある動物園の形式も模索したいです。",
        label: 0,
      },
      {
        id: 12,
        text: "子どもたちの学び場としての価値は大きい。それと同時に動物の生活環境を考慮する必要がある。",
        label: 0,
      },
      {
        id: 13,
        text: "動物園は科学的研究や教育の場として理想です。動物の福祉も一緒に考える姿勢が大切。",
        label: 0,
      },
      {
        id: 14,
        text: "地域の観光資源としての動物園の価値はある一方で、動物の福祉への投資も必要です。",
        label: 0,
      },
      {
        id: 15,
        text: "研究のための動物園は必要だが、展示の方法や規模については見直しが必要。",
        label: 0,
      },
      {
        id: 16,
        text: "今の動物園の在り方を尊重しつつ、福祉も考えた新しい動物園を模索するべきだ。",
        label: 0,
      },
      {
        id: 17,
        text: "動物園としての動物の保存は大切だが、野生での生活を考慮させるべき動物もいる。",
        label: 0,
      },
      {
        id: 18,
        text: "動物園での学びを重視しつつ、動物のストレスを最小限にする方法を考えるのも大事よな。",
        label: 0,
      },
      {
        id: 19,
        text: "動物園の存在がある上で、動物たちの待遇改善を考えませんか。",
        label: 0,
      },
      {
        id: 20,
        text: "動物の福祉を考えると、自然の中で自由にさせたい。動物園は見直しの時期が来ている。",
        label: 1,
      },
      {
        id: 21,
        text: "動物園の代わりに、動物たちが自由に過ごせる場所を増やすべきだと思う。",
        label: 1,
      },
      {
        id: 22,
        text: "教育のためとはいえ、檻の中の動物たちの目は悲しそうでした。",
        label: 1,
      },
      {
        id: 23,
        text: "動物を展示する文化は、少し時代遅れになってきていると感じる。",
        label: 1,
      },
      {
        id: 24,
        text: "環境や動物の福祉に配慮した観光資源の開発を、動物園とは別に推進すべきだ。",
        label: 1,
      },
      {
        id: 25,
        text: "野生の動物の行動や生態を理解するには、動物園ではなく自然な環境が最も適しています。",
        label: 1,
      },
      {
        id: 26,
        text: "現代の価値観や倫理観を反映し、動物を閉じ込める文化は見直すべきです。",
        label: 1,
      },
      {
        id: 27,
        text: "野生での再導入プログラムを重視した、動物園よりも別の形を模索すべきではないか。",
        label: 1,
      },
      {
        id: 28,
        text: "VR技術などを用いて、動物園の代わりに、動物たちの自然な生態を教育に取り入れる方法もある。",
        label: 1,
      },
      {
        id: 29,
        text: "動物の福祉を本当に考えるなら、檻から出してより自然な環境での生活を支援すべきです。",
        label: 1,
      },
      {
        id: 30,
        text: "動物たちは私たちの娯楽のために閉じ込められるべきではないのです。",
        label: 1,
      },
      {
        id: 31,
        text: "自由であるべき動物たちを、一生檻の中で過ごさせるなんて絶対に許せない。",
        label: 1,
      },
      {
        id: 32,
        text: "人間のエゴで動物を閉じ込める文化は、今すぐに終わらせるべきです。",
        label: 1,
      },
      {
        id: 33,
        text: "動物園は動物の苦しみを見世物にしているだけ。これ以上、そんな場所を許容するべきではない。",
        label: 1,
      },
      {
        id: 34,
        text: "動物の福祉を犠牲にした観光は、長期的には持続的でない。今すぐ無くすべき。",
        label: 1,
      },
      {
        id: 35,
        text: "真の動物学研究は、動物たちの自由な生態を追求するべきであり、動物園はそれを妨げていると考えてます。",
        label: 1,
      },
      {
        id: 36,
        text: "動物を閉じ込める文化は古く、新しい時代の倫理観とは合致していないのでは。",
        label: 1,
      },
      {
        id: 37,
        text: "動物を檻に閉じ込めることは、生態系のバランスを崩す可能性があると思います。",
        label: 1,
      },
      {
        id: 38,
        text: "正直、子どもたちに本当の自然や動物の大切さを伝えるためには、動物園は不要。",
        label: 1,
      },
      {
        id: 39,
        text: "一切の動物を檻の中に閉じ込める行為は、現代社会において許容されるべきではない。",
        label: 1,
      },
    ],
  },
  {
    id: 1,
    imagePath: "/dummy_news_image.png",
    largeImagePath: "/dummy_news_image_large.png",
    title: "ニュースタイトル",
    text: "タイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば。 　未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきか。 　過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば。あれば。あれば。あれば。",
    textShort:
      "タイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に。２行要約。",
    unavailable: true,
  },
  {
    id: 2,
    imagePath: "/dummy_news_image.png",
    largeImagePath: "/dummy_news_image_large.png",
    title: "ニュースタイトル",
    text: "タイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば。 　未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきか。 　過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば。あれば。あれば。あれば。",
    textShort:
      "タイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に。２行要約。",
    unavailable: true,
  },
  {
    id: 3,
    imagePath: "/dummy_news_image.png",
    largeImagePath: "/dummy_news_image_large.png",
    title: "ニュースタイトル",
    text: "タイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば。 　未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきか。 　過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば。あれば。あれば。あれば。",
    textShort:
      "タイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に。２行要約。",
    unavailable: true,
  },
];
