import { Topic } from "./types";

export const topicList: Topic[] = [
  {
    id: 0,
    imagePath: "/news1_image.png",
    largeImagePath: "/news1_image_large.png",
    title: "【 AIは人の仕事を助けるのか、それとも奪うのか 】",
    text: "「Job総研」の調査により、多くの職業人がAIによる仕事の効率化を認識している一方で、AIによる仕事の奪取を懸念していることが明らかになりました。 \n\n特に若年層ではこの懸念が顕著で、AIの普及による影響が焦点となっています。AIの進化は社会に大きな影響を与えることは間違いありませんが、それが助けになるのか、それとも仕事を奪うのかはこれからの発展次第です。",
    textShort:
      "AIの進化は社会に大きな影響を与える。それが助けになるのか、それとも仕事を奪うのか？",
    contents: [
      {
        id: 0,
        text: "AIは問題を解くための友達みたいなもの。エンジニアしてるけど、僕たちがもっと面白い仕事に集中できるようになったよ。",
        label: 0,
      },
      {
        id: 1,
        text: "普段仕事でAIを使うと、何が売れるか、人々が何を好むかを予想するのが簡単になります。たくさんの情報を見るのはAIの得意なところです。",
        label: 0,
      },
      {
        id: 2,
        text: "AIは、文章を作ったりそれをチェックをしたりといった、ちょっと面倒な仕事を助けてくれています。それで、私は他の作業にもっと時間を使うことができます。",
        label: 0,
      },
      {
        id: 3,
        text: "医者ですが、AIによる病気のデータ解析や画像診断は、私たちの仕事を助け、患者さんをより早く治すことができると考えてます。AIの進歩はとてもありがたい。",
        label: 0,
      },
      {
        id: 4,
        text: "AIは日々の仕事を効率化し、重要な決定をするための時間を提供してくれます。AIが人々の仕事を奪うという考え方もあるかもしれませんが、それはみんなの働き方を良くするためなのでは？",
        label: 0,
      },
      {
        id: 5,
        text: "AIが面倒な作業をしてくれるから、クリエイターとして俺たちはもっと面白いアイデアを考える時間ができたんだ。仕事を奪われると感じる人もいるかもしれないけど、それはないかなー",
        label: 0,
      },
      {
        id: 6,
        text: "大学生です。そろそろ卒業ですが、AIが僕たちに合った仕事を探してくれれば、就活がもっと楽になると思うので早くそういうので楽したい。",
        label: 0,
      },
      {
        id: 7,
        text: "AIによる作業の効率化は、時間とお金の節約につながります。これほんと。新しい時代の到来です。",
        label: 0,
      },
      {
        id: 8,
        text: "そういえばAIが美味しい料理の作り方や、健康的な食事のアドバイスをくれるらしいのをみたことある。仕事を奪うというより、新しいアイデアをくれるんじゃないかな？",
        label: 0,
      },
      {
        id: 9,
        text: "AIっていう新しい技術が出てきたおかげで、新しいことを学ぶきっかけができました。奪うのではなく、新しいことを学ぶチャンスをくれてる気が…",
        label: 0,
      },
      {
        id: 10,
        text: "AIが仕事を奪う？そんなことないです。面白いことを作る時間が増え、僕たちはもっと創造的になれると考えてます。",
        label: 0,
      },
      {
        id: 11,
        text: "人々が何を好むかを予測するのが得意なAIが仕事を奪うだなんて考えられない。",
        label: 0,
      },
      {
        id: 12,
        text: "AIが文章作成やチェックをしてくれることで、私の仕事はもっと面白なったんだけどな。奪ってはないです。",
        label: 0,
      },
      {
        id: 13,
        text: "医者の視点から言うと、AIはただの道具なんだけどね。それによって私たちの仕事がより正確で効率的になるだけ。それが「仕事を奪う」とは違う。",
        label: 0,
      },
      {
        id: 14,
        text: "AIがいるおかげで、私たちはより重要な問題に集中できる時間が増えました。仕事を奪うというより、より価値のある仕事に集中できるようにしてくれています。",
        label: 0,
      },
      {
        id: 15,
        text: "AIが私たちの仕事を奪うと感じる？いや、むしろ、AIがいるおかげで私たちはより創造的な仕事に時間を費やせている。",
        label: 0,
      },
      {
        id: 16,
        text: "正直、AIが就活の助けになってる。それが仕事を奪うというより、最適なキャリアパスを見つける手助けをしてくれていると感じている。",
        label: 0,
      },
      {
        id: 17,
        text: "お金と時間を節約するAIが僕たちの仕事を奪うなんて思えないです。",
        label: 0,
      },
      {
        id: 18,
        text: "AI新しいアイデアを教えてくれるのはすごいね。それが僕たちの仕事を奪うというのは違って、協力じゃない？",
        label: 0,
      },
      {
        id: 19,
        text: "AIが出てきたおかげで本当に新しいことを学ぶ機会が増えたよ。もうAIないと困るかなぁ",
        label: 0,
      },
      {
        id: 20,
        text: "職場で導入したAIがだんだんと上手くなってきて、人間の手が必要ない作業が増えてきた。まるで俺たちが要らないみたいで少し心配。",
        label: 1,
      },
      {
        id: 21,
        text: "私、翻訳の仕事をしています。AIの翻訳技術が上がってきてるから、最近私の仕事が少なくなってきてることに最近気づきました。",
        label: 1,
      },
      {
        id: 22,
        text: "AIの自動運転技術が進化して、ドライバーの仕事がなくなるかもしれないって聞いたんだけどさ、まじ俺の生計を奪うことになるじゃないか。",
        label: 1,
      },
      {
        id: 23,
        text: "AIが人事の仕事を自動化するってこの前聞きました。でも人間の判断が必要な部分もあると思う。人じゃないとストレスなことがたくさん起きそう。",
        label: 1,
      },
      {
        id: 24,
        text: "もうすでにAIが店員の仕事を奪っていくのが見えてきてますよね。レジに人がいないし、お客さんとのコミュニケーションがなくなってますよね。",
        label: 1,
      },
      {
        id: 25,
        text: "教師です。最近のAI教育ツールを見ると、自分の仕事がAIに取って代わられるのが怖です。正直、子供たちには人間の教師が必要かと思います。",
        label: 1,
      },
      {
        id: 26,
        text: "銀行ではもうAIがカスタマーサービスをやっているよ。私の仕事がなくなるのかなって最近思うんだ。これから大勢の人々が影響を受けるかと。",
        label: 1,
      },
      {
        id: 27,
        text: "研究者をやってるものですが、AIがデータ解析や予測モデルの作成、全てやってます。私たちの仕事が減ってるのは本当です。",
        label: 1,
      },
      {
        id: 28,
        text: "自動化のおかげで、一部の作業はなくなった。さらに、それは新しい種類の仕事が出てくるよりも早い。AIが我々の仕事を奪う。",
        label: 1,
      },
      {
        id: 29,
        text: "東京中の自動レジが増えてきて、店員が減っているのを見てる。でも便利か？なんとなく、人間らしさが失われていくような気がするんだ。",
        label: 1,
      },
      {
        id: 30,
        text: "大手企業に勤めてるんだけど、AIが人間の仕事を奪っていく様子を目の当たりにして、まさに恐怖。何もかもが冷たい数字。",
        label: 1,
      },
      {
        id: 31,
        text: "毎日コンビニで自動レジやAIストアが広がる度に、働く場所がなくなるのが本当に怖いとおもうんです。人間の接客って必要ないんですか？",
        label: 1,
      },
      {
        id: 32,
        text: "私は字幕作成してるんだけど、AI翻訳で仕事の需要がどんどん減ってる。この先生きていくためにはどうすればいいんだろう、怖いよ。",
        label: 1,
      },
      {
        id: 33,
        text: "製造業で働いてるんだけど、AIロボットに仕事を奪われるのが待ってるって分かってると、この先の生活に不安しかないよ。",
        label: 1,
      },
      {
        id: 34,
        text: "医療現場でAIが診断や手術を担うようになってます。自分は見てるだけです。自分の仕事がもう半分なくなってます。",
        label: 1,
      },
      {
        id: 35,
        text: "両親が農家で、AIが農業を自動化していくと、手作業の農家は存在意義がなくなるんじゃないかと感じる。それって、農家のプライドを奪うことじゃない？",
        label: 1,
      },
      {
        id: 36,
        text: "俺、自動運転のニュースをみるたびに、自分の生計が危ないって感じるんだよ。自分の生活を破壊することになるのかってね。",
        label: 1,
      },
      {
        id: 37,
        text: "俺たちの職場でAIが人の仕事をどんどん奪っていって、人が必要ない作業が増えてきたんだ。これじゃあ、俺たちはただの数字になるんじゃないか？",
        label: 1,
      },
      {
        id: 38,
        text: "私の仕事場ではAIが物件検索や評価までやり始めています。人の判断や経験を全く必要なくなってます。",
        label: 1,
      },
      {
        id: 39,
        text: "AIが人間の仕事をどんどん代替して、僕らがいらなくなる世界が見えてきてるんだ。それって、僕らの存在価値を奪うことになるよね。",
        label: 1,
      },
    ],
  },
  {
    id: 1,
    imagePath: "/dummy_news_image.png",
    largeImagePath: "/dummy_news_image_large.png",
    title: "ニュースタイトル",
    text: "タイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば。 　未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきか。 　過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば。あれば。あれば。あれば。",
    textShort:
      "タイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に。２行要約。",
    unavailable: true,
  },
  {
    id: 2,
    imagePath: "/dummy_news_image.png",
    largeImagePath: "/dummy_news_image_large.png",
    title: "ニュースタイトル",
    text: "タイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば。 　未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきか。 　過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば。あれば。あれば。あれば。",
    textShort:
      "タイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に。２行要約。",
    unavailable: true,
  },
  {
    id: 3,
    imagePath: "/dummy_news_image.png",
    largeImagePath: "/dummy_news_image_large.png",
    title: "ニュースタイトル",
    text: "タイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば。 　未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきか。 　過去に行くべきかタイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば。あれば。あれば。あれば。",
    textShort:
      "タイムマシーンがあれば、未来に行くべきか、過去に行くべきかタイムマシーンがあれば、未来に。２行要約。",
    unavailable: true,
  },
];
